cask_args appdir: '/Applications'

# Prerequisites for some of the apps
tap 'homebrew/bundle'
cask 'java'
cask 'xquartz' 

# Stuff
brew 'ant'
brew 'archey'
brew 'asciidoctor'
brew 'coreutils'
brew 'curl'
brew 'fontconfig'
brew 'freetype'
brew 'gettext'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'heroku'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'icu4c'
brew 'ideviceinstaller'
brew 'imagemagick'
brew 'jp2a'
brew 'jpeg'
brew 'less'
brew 'libplist'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libzip'
brew 'maven'
brew 'mongodb'
brew 'nettle'
brew 'node'
brew 'openssl'
brew 'pmd'
brew 'postgresql'
brew 'pyenv'
brew 'python3'
brew 'readline'
brew 'spark'
brew 'tmux'
brew 'unrar'
brew 'watch'
brew 'weechat'
brew 'yarn'

# More stuff
cask 'aerial'
cask 'alfred'
cask 'android-file-transfer'
cask 'arduino'
cask 'dash'
cask 'discord'
cask 'etcher'
#cask 'firefox'
cask 'gimp'
cask 'inkscape'
cask 'iterm2'
cask 'postman'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'sketch'
cask 'slack'
cask 'soapui'
cask 'soqlxplorer'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
